---
kind: enumMember
id: F:Autodesk.Revit.DB.BuiltInParameter.PREFER_DIM_SIDE_UI_FILTER
enum: Autodesk.Revit.DB.BuiltInParameter
source: html/fb011c91-be7e-f737-28c7-3f1e1917a0e0.htm
---
# Autodesk.Revit.DB.BuiltInParameter.PREFER_DIM_SIDE_UI_FILTER

"Prefer:": This is used by the UI to allow select prefer dimension side.